#Імпортуйте модуль datetime.
 # Для роботи з датами слід використовувати модуль datetime Python.
import datetime

# Функція приймає один параметр: date — рядок, що представляє дату у форматі 'РРРР-ММ-ДД'
#  (наприклад, '2020-10-09').
def get_days_from_today(date):

# Перетворіть рядок дати у форматі 'РРРР-ММ-ДД' у об'єкт datetime.
# Перетворення рядка в об'єкт datetime
    datetime_object = datetime.datetime.strptime(date, "%Y-%m-%d")
    
# Отримайте поточну дату, використовуючи datetime.today().
    now = datetime.datetime.today()
    print(now)
    
    #now = datetime(year=2021, month=5, day=5)

# Розрахуйте різницю між поточною датою та заданою датою.
# У розрахунках необхідно враховувати лише дні, 
# ігноруючи час (години, хвилини, секунди).
    days_diff = now - datetime_object
    print(days_diff.days)
    #print(now)

# Функція повертає ціле число, яке вказує на кількість днів від заданої дати до поточної.
#get_days_from_today("2021-10-09")
get_days_from_today("2027-10-01")


#Обробка винятків: функція має впоратися з неправильним форматом вхідних даних.
#?????? как обработать 