
# Використання модуля re для регулярних виразів 
import re

raw_numbers = [
    "067\\t123 4567",
    "(095) 234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)8889900",
    "38050-111-22-22",
    "38050 111 22 11   ",
    "    +38(050)123-32-34",
"     0503451234",
"(050)8889900",
"38050-111-22-22",
"38050 111 22 11   ",
]

#Функція нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' на початку.
def normalize_phone(phone_number):

# Перевірте, чи номер починається з '+', і виправте префікс згідно з вказівками.

    # Видалення всіх символів, крім цифр та '+', з номера телефону.
    # # r означає «сирий» рядок (raw string), який каже Python ігнорувати спеціальні символи такі як \n, \t тощо, 
    # в [^ ] будь-який символ, крім тих, що в дужках
    # \d задає будь-яку цифру, а \d+ — задає будь-яку послідовність з однієї або більше цифр. 
    pattern = r"[^\d+]"
    replacement = ""
    san_num = re.sub(pattern, replacement, phone_number)


    # Якщо міжнародний код відсутній та номер починається з '0', то додається код '+38'.
    if san_num.startswith("0"):
        san_num = "+38" + san_num
    # Якщо номер починається з міжнародним кодом ('38'),то додається лише '+'.
    elif san_num.startswith("38"):
        san_num = "+" + san_num
    # Функція повертає нормалізований телефонний номер у вигляді рядка.
    return san_num 

sanitized_numbers = [normalize_phone(num) for num in raw_numbers]
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers)
